#！/usr/bin/nev python
#-*-coding:utf-8 -*-
#Author :show530

date={
    '罗湖':{
        "东晓街道":{
            "东晓社区":["今日家园","阳光明居","泰和花园"],
            "布心社区":["彩世界","布心花园","东晓花园"],
            "水库社区":["宝湖花园","水库家园","宝丰源"]
        },
        "东湖街道":{
            "东乐社区":["东乐花园","百仕达一期","百仕达二期"],
            "翠鹏社区":["翠鹏花园","名仕达","泰宁豪苑"],
            "金鹏社区":["金鹏花园","天御境界","华都馨苑"]
        },
        "东门街道":{
            "湖贝社区":["木头龙小区","深业大厦","花都院"],
            "螺岭社区":["万众豪苑","缤纷时代家园","金城华庭"],
            "东门社区":["东门168","立新花园","万科彩园"]
             }
        },
    '福田':{
        "福田街道":{
            "福华社区":["皇岗新村","皇御苑","共和世家"],
            "福民社区":["福民新村","绿茵阁","福涛东园"],
            "华强社区":["华强花园","红荔村","长泰花园"]
                    },
        "园岭街道":{
            "园岭社区":["园岭新村","盛世鹏程","鸿翔花园"],
            "红岭社区":["桂木园小区","红岭新村","荔香坊"],
            "百花社区":["长城花园","核电花园","国城花园"]
                    },
        "梅林街道":{
            "上梅林社区":["颐林雅院","中康生活","梅林四村"],
            "下梅林社区":["梅林一村","梅林二村","书香门第"],
            "银湖社区":["银湖谷","金景花园","金湖花园"]
                   }
        }
}


choice1 = str(input("请选择大区： "))
if choice1 in date.keys():
    print("\n 您选择的是: "+ choice1)
    print("\n下属有以下街道： "+ str(date[choice1].keys()))

    choice2 = str(input("请选择街道： "))
    if choice2 in date[choice1].keys():
        print("\n 您选择的是: " + choice2)
        print("\n下属有以下社区： " + str(date[choice1][choice2].keys()))

        choice3 = str(input("请选择社区： "))
        if choice3 in date[choice1][choice2].keys():
            print("\n 您选择的是: " + choice3)
            print("\n下属有以下小区： " + str(date[choice1][choice2][choice3]))

            choice4 = str(input("请选择小区： "))
            if choice4 in date[choice1][choice2][choice3]:
                print("\n 您选择的是: " + str(choice4))
            else:
                print("您输入有误！")
        else:
            print("您输入有误！")
    else:
        print("您输入有误！")
else:
    print("您输入有误！")











